testdata/requests/ews_findfolder_shallow_davmail.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types" xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Header>
    <t:RequestServerVersion Version="Exchange2013_SP1"/>
  </soap:Header>
  <soap:Body>
    <m:FindFolder Traversal="Shallow">
      <m:FolderShape>
	<t:BaseShape>IdOnly
	</t:BaseShape>
	<t:AdditionalProperties>
	  <t:ExtendedFieldURI PropertyTag="0x6752" PropertyType="Integer"/>
	  <t:FieldURI FieldURI="folder:DisplayName"/>
	  <t:ExtendedFieldURI PropertyTag="0x6751" PropertyType="Integer"/>
	  <t:ExtendedFieldURI PropertyTag="0x10f3" PropertyType="String"/>
	  <t:ExtendedFieldURI PropertyTag="0x3008" PropertyType="SystemTime"/>
	  <t:ExtendedFieldURI PropertyTag="0x360a" PropertyType="Boolean"/>
	  <t:ExtendedFieldURI PropertyTag="0x670a" PropertyType="SystemTime"/>
	  <t:ExtendedFieldURI PropertyTag="0x3603" PropertyType="Integer"/>
	  <t:ExtendedFieldURI PropertyTag="0x3602" PropertyType="Integer"/>
	  <t:ExtendedFieldURI PropertyTag="0x3613" PropertyType="String"/>
	</t:AdditionalProperties>
      </m:FolderShape>
      <m:IndexedPageFolderView MaxEntriesReturned="500" Offset="0" BasePoint="Beginning"/>
      <m:Restriction>
	<t:Or>
	  <t:IsEqualTo>
	    <t:ExtendedFieldURI PropertyTag="0x3613" PropertyType="String"/>
	    <t:FieldURIOrConstant>
	      <t:Constant Value="IPF.Note"/>
	    </t:FieldURIOrConstant>
	  </t:IsEqualTo>
	  <t:Not>
	    <t:Exists>
	      <t:ExtendedFieldURI PropertyTag="0x3613" PropertyType="String"/>
	    </t:Exists>
	  </t:Not>
	</t:Or>
      </m:Restriction>
      <m:ParentFolderIds>
	<t:DistinguishedFolderId Id="msgfolderroot"/>
      </m:ParentFolderIds>
    </m:FindFolder>
  </soap:Body>
</soap:Envelope>
